Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: If you've selected multiple components using the Edit tool, then the attribute table will display attributes that are shared among all the selected components (excluding any wires).
ru_ru: Если вы выбрали несколько компонентов с помощью Инструмента Правка, то таблица атрибутов отобразит атрибуты, общие для всех выбранных компонентов (за исключением проводов).

source: Ticks Enabled
ru_ru: Такты включены

source: A separate one-bit input controls the display of the decimal point.
ru_ru: Отдельный однобитный вход управляет отображением десятичной точки.

source: DIN adopted the rectangular standard for digital components in 1976, but some engineers continue to use the older style; they appear to be increasingly rare.
ru_ru: DIN принял прямоугольную форму как стандарт для цифровых компонентов в 1976 году, но некоторые инженеры продолжают использовать устаревший стиль; они встречаются всё реже.

source: If the Parallel Load attribute is no, or if the Data Bits attribute is more than 4, then poking the register has no effect.
ru_ru: Если значение атрибута Параллельная загрузка - Нет, или если атрибут Биты данных больше 4, то нажатие на компонент не даёт никакого эффекта.

source: Each component type has a different set of attributes; to learn what they mean, go to the relevant documentation in the Library Reference.
ru_ru: Каждый тип компонента имеет свой набор атрибутов; чтобы узнать, что они означают, перейдите к соответствующей документации в Справке по библиотеке.

source: Each version is given a distinguishing version number.
ru_ru: Каждой версии придается отличительный номер версии.

source: int y = x ^ (x & (x - 1)); // first compute the last 1
ru_ru: int y = x ^ (x & (x - 1)); // сначала вычислить последнюю 1

source: To prevent this, we have made it clear that any patent must be licensed for everyone's free use or not licensed at all.
ru_ru: Чтобы предотвратить это, мы явно заявляем, что любой патент должен быть либо предоставлен всем для свободного использования, либо не предоставлен никому.

source: There is only one pin, an output whose bit width matches the Data Bits attribute.
ru_ru: Всего один контакт, выход, разрядность которого соответствует атрибуту Биты данных.

source: Logisim's default behavior for XOR gates is based on the IEEE 91 standard.
ru_ru: Поведение Logisim по умолчанию для элемента Исключающее ИЛИ основано на стандарте IEEE 91.

source: After clicking OK, Logisim will display a file selection dialog box.
ru_ru: После нажатия OK Logisim покажет диалоговое окно выбора файла.

source: If it is Falling Edge,, then this happens when the clock input changes from 1 to 0.
ru_ru: Если же значение - Задний фронт, то это происходит, когда значение тактового входа меняется с 1 на 0.

source: If all bits of the value are unknown (i.e., floating), then they are assumed to be 0.
ru_ru: Если все биты значения неизвестны (например, плавающие), то предполагается, что они равны 0.

source: The memory image file should be in Logisim's memory image format.
ru_ru: Файл образа памяти должен быть в формате образа памяти Logisim.

source: Illustrates how to make a component that has internal state, in particular an 8-bit counter that iterates through Gray codes.
ru_ru: Показывает, как сделать компонент, имеющий внутреннее состояние, в частности, 8-битный счётчик, который перебирает коды Грея.

source: This helper method will end
ru_ru: Этот вспомогательный метод закончит

source: You can see that Logisim has three categories of libraries.
ru_ru: Вы видите, что Logisim имеет три категории библиотек.

source: The horizontal positioning technique for the text relative to the label's official location (where the mouse was clicked in creating the label).
ru_ru: Метод горизонтального выравнивания для текста по отношению к официальному расположению метки (тому месту, где произошло нажатие мыши при создании метки).

source: When the component is selected or being added, the digits '0' through '9' alter its Number of Stages attribute and Alt-0 through Alt-9 alter its Data Bits attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 0 до 9 меняют его атрибут Количество ступеней, а комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных.

source: (If all inputs are unconnected, the output is the error value X.) Some users, though, prefer that Logisim insist that all inputs be connected, since this is what corresponds to real-world gates.
ru_ru: (Если все входы не подключены, то на выходе значение ошибки X.) Некоторые пользователи, однако, предпочитают, чтобы Logisim настаивал, чтобы все входы были подключены, поскольку это соответствует реальным элементам.

source: As long as this is 1, the other inputs have no effect.
ru_ru: Пока на нём 1, другие входы не имеют эффекта.

source: South edge, third from left (input, bit width 1)
ru_ru: Южный край, третий слева (вход, разрядность равна 1)

source: The Window and Help menus
ru_ru: Меню Окно и Справка

source: If you have delved into a subcircuit's state and then moved back out, this submenu lists the subcircuits below the current circuit.
ru_ru: Если вы углубились в состояние подсхемы и затем вышли обратно, то это подменю выдаст список схем ниже состояния текущей схемы.

source: The text pane below this displays the same information in ASCII form.
ru_ru: Текстовое поле ниже отображает ту же информацию в виде ASCII последовательности.

source: The component's n-gate input.
ru_ru: Вход n-затвор компонента.

source: Radix
ru_ru: Основание

source: In its simplest form, each project has only one circuit (called "main" by default), but it is easy to add more: Select Add Circuit... from the Project menu, and type any name you like for the new circuit you want to create.
ru_ru: В своей простейшей форме каждый проект имеет только одну схему (по умолчанию называемую "main"), но легко можно добавить больше: выберите Добавить схему... из меню Проект, а затем введите любое название для новой схемы, которую вы хотите создать.

source: If identifiable sections of that work are not derived from the Program, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works.
ru_ru: Если известные части этого произведения не были основаны на Программе и могут обоснованно считаться независимыми и самостоятельными произведениями, то эта Лицензия и ее условия не распространяются на эти части, если вы распространяете их как отдельные произведения.

source: If the select input contains any unspecified (i.e., floating) bits, then the output is completely floating.
ru_ru: Если выбирающий вход содержит неопределённые (например, плавающие) биты, то выход будет полностью плавающим.

source: b) Accompany it with a written offer, valid for at least three
ru_ru: Сопроводите ее письменным предложением, действительным по крайней мере в течение трех

source: The second parameter is the
ru_ru: Второй параметр - это

source: Multiple-Input Behavior (XOR and XNOR only)
ru_ru: Многовходовое поведение (только для Исключающее ИЛИ и Исключающее ИЛИ-НЕ)

source: The International tab
ru_ru: Вкладка Интернациональные

source: Enable Out: 1 if this component is enabled and none of the indexed inputs are 1; otherwise the output is 0.
ru_ru: Разрешающий выход: 1, если этот компонент включен и ни один из нумерованных входов не содержит 1, в противном случае на выходе 0.

source: TableSorter, ascribed to Philip Milne, Brendon McLean, Dan van Enckevort, Parwinder Sekhon, and ouroborus@ouroborus.org
ru_ru: TableSorter, приписываемый Филипу Милну, Брендону Маклину, Дэну ван Энкеворту, Парвиндеру Секону, и ouroborus@ouroborus.org

source: This menu item is available only when editing a circuit's appearance.
ru_ru: Этот пункт меню доступен только при редактировании внешнего вида схемы.

source: The project will initially be a copy of the currently selected template.
ru_ru: Проект первоначально будет копией текущего выбранного шаблона.

source: Typing the Backspace key will scroll up one line.
ru_ru: Нажатие клавиши Backspace пролистает одну строку вверх.

source: Menu Tool Behavior
ru_ru: Поведение Инструмента Меню

source: (Ticks are disabled by default.) A "tick" is Logisim's unit of time; the speed at which ticks occur can be selected from the Simulate menu's Tick Frequency submenu.
ru_ru: (по умолчанию такты отключены). "Такт" - это единица времени в Logisim; скорость, с которой сменяются такты, можно выбрать из подменю Тактовая частота меню Моделировать.

source: Every input and output on every component in the circuit has a bit width associated with it.
ru_ru: Каждый вход и выход каждого компонента в схеме имеет разрядность, связанную с ним.

source: The CounterData object remembers both the counter's current value, as well as the last clock input seen (to detect rising edges).
ru_ru: Объект CounterData запоминает как состояние текущего состояния счётчика, так и последнее состояние тактового входа (чтобы обнаруживать передние фронты).

source: More information about the translations can be found on International Preferences page.
ru_ru: Более подробную информацию о переводах можно найти на странице Интернациональные настройки.

source: You will find the documentation beyond these examples fairly meager.
ru_ru: Документация за пределами этих примеров покажется вам довольно скудной.

source: This will not happen, though, if shift-clicking is mapped to another tool instead.
ru_ru: Ничего из этого не произойдёт, впрочем, если нажатие мыши с зажатой клавишей Shift привязано к другому инструменту.

source: The Edit tool allows the user to rearrange existing components and to add wires.
ru_ru: Инструмент Правка позволяет изменять существующие компоненты и добавлять провода.

source: The Gate Output When Undefined drop-down menu configures how the built-in logic gates behave when some inputs are unconnected or are floating.
ru_ru: Раскрывающееся меню Выход элемента при неопределённости определяет, как ведут себя логические элементы, если некоторые их входы не подключены, или на них плавающее значение.

source: Application preferences
ru_ru: Настройки приложения

source: All of the tools included in Logisim's built-in libraries are documented in this reference material.
ru_ru: Все инструменты, включенные во встроенную библиотеку Logisim, представлены в этом справочном материале.

source: This switches the explorer pane so that it shows the hierarchy of subcircuits being simulated.
ru_ru: Это переключает панель проводника таким образом, что она отображает иерархию моделируемой схемы.

source: But NOT gates don't react instantaneously to their inputs in reality, and neither do they in Logisim.
ru_ru: Но элементы НЕ не реагируют мгновенно на сигналы на входах в реальности, и в Logisim - тоже.

source: Thus, the top left corner of the bounding box is 30 pixels
ru_ru: Так, левый верхний угол ограничивающего прямоугольника на 30 пикселей

source: This page describes the first three tabs, Inputs, Outputs, and Table.
ru_ru: На этой странице описаны первые три вкладки: Входы, Выходы, и Таблица.

source: Shows the Application Preferences window.
ru_ru: Отображает окно настроек приложения.

source: * sometimes you need to do something particular to each instance, so you
ru_ru: * иногда вам нужно делать что-то специфическое с каждым экземпляром, так что вам

source: See pop-up menus and files in the User's Guide.
ru_ru: См. Всплывающие меню и файлы в Руководстве пользователя.

source: Of course, we would first create a new circuit, which we'll call "4:1 MUX." To add 2-to-1 multiplexers into our circuit, we click the 2:1 MUX circuit once in the explorer pane to select it as a tool, and then we can add copies of it, represented as boxes, by clicking within the canvas.
ru_ru: Конечно, сначала мы создадим новую схему, которую мы назовём "4:1 MUX". Чтобы добавить мультиплексоры 2-в-1 в нашу схему, мы нажмём один раз на схему 2:1 MUX в панели проводника, чтобы выбрать её в качестве инструмента, и затем мы можем добавлять её копии, представляемые в виде коробок, щёлкая на холсте.

source: North edge, labeled b in (input, bit width 1)
ru_ru: Северный край, отмечен b in (вход, разрядность равна 1)

source: truth tables, which list all possible input combinations and the corresponding outputs
ru_ru: таблицы истинности, которые перечисляют все возможные комбинации значений на входах и значения на соответствующих выходах

source: Toolbar location: This drop-down menu configures the location of the toolbar within the overall window.
ru_ru: Расположение панели инструментов: это выпадающее меню настраивает расположение панели инструментов в пределах окна.

source: Preferences...
ru_ru: Настройки...

source: Using subcircuits
ru_ru: Использование подсхем

source: South edge, second pin from right (output, bit width 1)
ru_ru: Южный край, второй контакт справа (выход, разрядность равна 1)

source: Customized appearance
ru_ru: Модифицированный внешний вид

source: One synchronous load/store port (default)
ru_ru: Один синхронный порт чтения/записи (по умолчанию)

source: For instance, we might issue the following two commands to collect the output of the master circuit and the query circuit.
ru_ru: Например, мы могли бы ввести следующие две команды чтобы получить вывод эталонной схемы и проверяемой схемы.

source: If you're familiar with computer programming, you're familiar with the subprogram concept, whether it's called a subroutine, function, method, or procedure in your favored language.
ru_ru: Если вы знакомы с программированием, то вам известна концепция подпрограммы, которая может назваться процедурой, функцией, или методом в вашем любимом языке.

source: This occurs asynchronously - that is, without regard to the current clock input value.
ru_ru: Это происходит асинхронно - то есть вне зависимости от текущего значения на тактовом входе.

source: The Expression tab
ru_ru: Вкладка Выражение

source: JAR libraries are libraries that are developed in Java but not distributed with Logisim.
ru_ru: Библиотеки JAR - библиотеки, разработанные в Java, но не распространяемые вместе с Logisim.

source: * other circumstances, even if there is no reason to expect it to change
ru_ru: * других обстоятельствах, даже если нет никаких оснований ожидать, что он изменит

source: Logisim contains a fairly thorough collection of built-in libraries of Java components, but it can also load additional libraries written by you or others.
ru_ru: Logisim содержит достаточно полную коллекцию встроенных библиотек компонентов Java, но он также может загружать дополнительные библиотеки, написанные вами или другими людьми.

source: The square option means that each pixel is drawn as a 10x10 square, filling the component with no gaps between pixels.
ru_ru: Вариант Квадратная означает, что каждый пиксель отрисовывается как квадрат 10x10, заполняя компонент без пробелов между пикселями.

source: Move Up moves the currently selected item of the toolbar up/left one spot.
ru_ru: Сдвинуть вверх перемещает выбранный в данный момент элемент панели инструментов на одну позицию вверх/влево.

source: Page number
ru_ru: Номер страницы

source: Below, I have opened the Gates library and selected the NAND tool from it.
ru_ru: Ниже я открыл библиотеку Элементы и выбрал инструмент И-НЕ из неё.

source: A small green circle is drawn in such a circumstance to indicate this.
ru_ru: При этом отображается небольшой зелёный кружок чтобы сообщить об этом.

source: For P-type transistors, the transistor will transmit if the gate value is 0; for N-type transistors, this will trigger the transistor if the gate value is 1.
ru_ru: Для транзисторов p-типа транзистор будет передавать значение, если значение на затворе - 0; для транзисторов n-типа это будет происходить, если на затворе - 1.

source: Next: Other verification options.
ru_ru: Далее: Другие параметры проверки.

source: You can select both options if you want to use only two-input NAND gates.
ru_ru: Вы можете выбрать оба варианта, если вы хотите использовать только двухвходовые элементы И-НЕ.

source: Load: Selects whether the RAM should emit (on D) the value at the current address (A).
ru_ru: Чтение: выбирает, должно ли ОЗУ выдавать (на выход D) значение по текущему адресу.

source: The optional additional files named on the command line will be opened as separate windows within Logisim.
ru_ru: Необязательные дополнительные файлы, указанные в командной строке, будут открыты как отдельные окна в Logisim.

source: Below this area is a list of current mappings.
ru_ru: Ниже этой области - список текущих привязок.

source: The table includes four columns:
ru_ru: Таблица включает четыре столбца:

source: The gate's output, whose value is computed based on the current inputs as described above.
ru_ru: Выход элемента, значение на котором вычисляется на основании текущих значений на входах, как описано выше.

source: P-type
ru_ru: p-тип

source: East edge (output, bit width from Bit Width Out attribute)
ru_ru: Восточный край (выход, разрядность соответствует атрибуту Разрядность выхода)

source: But if the input were 00000000 and the component is to find the lowest-order 1, then the south output would be 0 — and the output on the east edge would be 0 as well.
ru_ru: Но если на входе было бы 00000000 и компонент искал бы младшую 1, то на южном выходе был бы 0 - и на выходе на восточном крае был бы тоже 0.

source: Carry: When load and count indicate to increment, this output is 1 whenever the counter is at its maximum.
ru_ru: Перенос: когда входы загрузка и счёт указывают счётчику увеличиться, значение на этом выходе 1, если регистр имеет максимальное значение.

source: The determination of transmitting or disconnecting depends on the type of transistor: A P-type transistor (indicated by a circle on the gate line) transmits when gate is 0, while an N-type transistor (which has no such circle) transmits when gate is 1.
ru_ru: Решение о передаче или разъединении зависит от типа транзистора: транзистор p-типа (обозначенный кружком на линии затвора) передаёт значение, когда на затворе 0, а транзистор n-типа (без кружка) передаёт значение, когда на затворе 1.

source: If this is left unconnected, the decimal point remains off.
ru_ru: Если этот вход не подключен, то десятичная точка остаётся выключенной.

source: XNOR
ru_ru: Исключающее ИЛИ-НЕ

source: The base (for example, binary, decimal, or hexadecimal) in which a value is displayed.
ru_ru: Основание (например, двоичное, десятичное или шестнадцатеричное), по которому отображается значение.

source: Matrix Rows
ru_ru: Строки матрицы

source: Technically speaking, the algorithm used to compute the pseudorandom sequence is a linear congruential generator: Starting from a seed r0, the following number r1 is the number
ru_ru: С технической точки зрения, алгоритм, используемый для вычисления псевдослучайных последовательностей - это линейный конгруэнтный генератор: начиная с семени r0, следующий номер r1 - это число

source: Output: Emits the value stored in each stage, with the youngest stage reflected on the leftmost of the pins (next to the clear input).
ru_ru: Выход: выдаёт значение, хранящееся в каждой ступени; младшая ступень отражена в крайнем левом контакте (рядом со входом Очистка).

source: /** Constructs an instance of this library.
ru_ru: /** Создаёт экземпляр этой библиотеки.

source: You can also navigate and edit the truth table using the keyboard.
ru_ru: Вы также можете перемещаться и редактировать таблицу истинности с помощью клавиатуры.

source: Note that this does not include changes to the circuit state (as with manipulations performed by the Poke Tool).
ru_ru: Обратите внимание, что это не включает изменения в состоянии схемы (такие как манипуляции, выполненные Инструментом Нажатие).

source: Displays the value of its input by coloring the LED (as specified by its Color attribute) or not depending on whether the input is 1 or 0.
ru_ru: Отображает значение своего входа, подсвечивая светодиод (цветом, заданным атрибутом Цвет) или не подсвечивая, в зависимости от того, какое значение на входе - 1 или 0.

source: It is by Thanos Kakarountas, a faculty member at Technological Educational Institute of Ionian Islands in Greece.
ru_ru: Его выполнил Танос Какароунтас, преподаватель Технологического образовательного института Ионических островов в Греции.

source: (Here we're describing the API for the current version of Logisim.
ru_ru: (Здесь мы описываем API текущей версии Logisim.

source: Below this is the minimized expression itself, formatted as in the Expression tab's display.
ru_ru: Ниже - само минимизированное выражение, отформатированное так же, как во вкладке Выражение.

source: This tunnel is connected to all other tunnels with exactly the same label.
ru_ru: Этот тоннель соединён со всеми остальными тоннелями с точно такой же меткой.

source: All Logisim is divided into three parts, called the explorer pane, the attribute table, and the canvas.
ru_ru: Весь Logisim разделён на три части, называемые панель проводника, таблица атрибутов, и холст.

source: For example, Logisim's maximum speed for a reasonably large circuit might be 16 Hz; you can select a faster tick rate, but the actual speed will not exceed 16 Hz.
ru_ru: Например, максимальная скорость Logisim для достаточно большой схемы может быть 16 Гц; вы можете выбрать более высокую тактовую частоту, но фактическая скорость не будет превышать 16 Гц.

source: To edit a particular value, click the value within the display rectangle.
ru_ru: Для изменения определённого значения нажмите на значение внутри прямоугольника.

source: The 2:1 multiplexer contains two AND gates (and the 4:1 circuit includes none), so the Unique count of AND gates would be 2; but if you were to build the 4:1 multiplexer using this diagram, you would actually need 2 AND gates for each of the three 2:1 multiplexers, so the Recursive count is 6.
ru_ru: Мультиплексор 2:1 содержит два элемента И (а схема 4:1 не содержит ни одного), так что количество Уникальных элементов И будет 2; но если вы строили мультиплексор 4:1 с использованием этой схемы, вам потребовалось 2 элемента И для каждого из трёх мультиплексоров 2:1, так что количество Рекурсивно равно 6.

source: Among the built-in libraries, the following types of components support logging.
ru_ru: Среди встроенных библиотек следующие типы компонентов поддерживают запись в журнал.

source: // The following method invocation sets things up so that the instance's
ru_ru: // Следующее обращение к методу устанавливает всё так, чтобы состоянием

source: * component.
ru_ru: * компоненту.

source: To transmit data into and out of the component, you will need to use a Controlled Buffer component, as illustrated below.
ru_ru: Для передачи данных в компонент и из него, вам нужно использовать компонент Управляемый буфер, как показано ниже.

source: If the value to be negated happens to be the least negative value, then its negation (which cannot be represented in two's-complement form), is still the least negative value.
ru_ru: Если значение для отрицания оказалось наименьшим отрицательным значением, то его отрицание (которое не может быть представлено в дополнительном коде) остаётся наименьшим отрицательным значением.

source: If any portion of this section is held invalid or unenforceable under any particular circumstance, the balance of the section is intended to apply and the section as a whole is intended to apply in other circumstances.
ru_ru: Если какая-либо часть этого раздела не имеет силы или не может быть применена при любых конкретных обстоятельствах, то подразумевается, что имеет силу остальная часть раздела, и весь Раздел имеет силу при других обстоятельствах.

source: Load Library
ru_ru: Загрузить библиотеку
